import { View, Text, TouchableOpacity, ScrollView } from "react-native";
import React from "react";
import { container, textHeader, textTitle } from "./PolicyScreenStyle";
import { Ionicons } from "@expo/vector-icons";
import { getStatusBarHeight } from "react-native-status-bar-height";

const PolicyScreen = ({ navigation, props }) => {
  return (
    <View style={container}>
      <View style={{ marginTop: getStatusBarHeight() }}>
        <View style={{ paddingHorizontal: 10 }}>
          <TouchableOpacity
            onPress={() => {
              navigation.goBack();
            }}
          >
            <Ionicons name="arrow-back" size={30} color="#4691FB" />
          </TouchableOpacity>
        </View>
        <Text style={textHeader}>{"นโยบายของแอปพลิเคชัน"}</Text>

        <ScrollView showsVerticalScrollIndicator={false}>
          <View
            style={{
              backgroundColor: "#fff5",
              marginHorizontal: 30,
              marginTop: 20,
            }}
          >
            <Text style={textTitle}>คำนิยาม</Text>
            <Text style={{fontFamily: "Kanit"}}>
                  1.1 “ข้อมูลส่วนบุคคล” หมายถึง
              ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม
              แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ{"\n"}
                  1.2 “คณะกรรมการคุ้มครองข้อมูลส่วนบุคคล”หมายถึง
              คณะกรรมการที่ได้รับการแต่งตั้งขึ้นภายใต้พระราชบัญญัติฯ
              โดยมีหน้าที่และอำนาจกำกับดูแล ออกหลักเกณฑ์ มาตรการ
              หรือข้อปฏิบัติอื่นใดที่เกี่ยวข้องกับการคุ้มครองข้อมูลส่วนบุคคลตามพระราชบัญญัติฯ
              {"\n"}
                  1.3 “เจ้าของข้อมูลส่วนบุคคล” หรือ “ท่าน” หมายถึง
              บุคคลซึ่งสามารถถูกระบุตัวตนได้โดยข้อมูลส่วนบุคคล ไม่ว่าจะโดยทางตรง
              หรือทางอ้อม เพื่อวัตถุประสงค์ของนโยบายฯ ฉบับนี้
              เจ้าของข้อมูลส่วนบุคคล หมายถึง ผู้ใช้งาน ตัวแทนนิติบุคคล
              และตัวแทนพันธมิตรทางธุรกิจ{"\n"}     1.4 “ตัวแทนนิติบุคคล” หมายถึง
              ตัวแทนผู้มีอำนาจ และบุคคลติดต่อของลูกค้านิติบุคคล{"\n"}
                  1.5 “ตัวแทนพันธมิตรทางธุรกิจ” หมายถึง ตัวแทนผู้มีอำนาจ
              และบุคคลติดต่อของพันธมิตรทางธุรกิจ{"\n"}{" "}
                  1.6 “ผู้ใช้งาน” หมายถึง บุคคลใด ๆ ที่ได้เข้าเยี่ยมชม
              หรือเข้าใช้งานแอปพลิเคชัน
              บุคคลที่ได้ทำการลงทะเบียนสมัครเป็นสมาชิกของแอปพลิเคชัน
              หรือสมัครลงทะเบียนรับข่าวสารจากแอปพลิเคชัน และให้หมายรวมถึงลูกจ้าง
              หรือบุคลากรของลูกค้านิติบุคคล{"\n"}{" "}
                  1.7 “พันธมิตรทางธุรกิจ” หมายถึง
              พันธมิตรทางธุรกิจซึ่งเป็นนิติบุคคลซึ่งได้เสนอสินค้า
              และ/หรือบริการบนแอปพลิเคชัน อาทิ คูปองส่วนลด หรือคูปองเงินสด
              เป็นต้น{"\n"}     1.8 “พระราชบัญญัติฯ” หมายถึง
              พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
              ซึ่งอาจมีการแก้ไขเป็นครั้งคราว รวมถึงกฎเกณฑ์ ข้อบังคับ
              หรือประกาศอื่นใดที่ออกภายใต้พระราชบัญญัติดังกล่าว{"\n"}
                  1.9 “ลูกค้านิติบุคคล” หมายถึง ลูกค้าของบริษัทซึ่งเป็นนิติบุคคล
              และประสงค์ที่จะสมัครใช้บริการแอปพลิเคชันเพื่อให้ลูกจ้าง
              และบุคลากรของตนนั้นสามารถเข้าถึง และใช้งานแอปพลิเคชันได้{"\n"}
                  1.10 “หน่วยงานกำกับดูแล” หมายถึง หน่วยงานใด ๆ
              ที่มีอำนาจในการกำกับดูแลการประกอบธุรกิจของบริษัท ซึ่งหมายรวมถึง
              แต่ไม่จำกัดเพียง คณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
              หรืออุปกรณ์อื่นใดที่มีลักษณะคล้ายคลึงกัน{"\n"}
                  1.11 “แอปพลิเคชัน” หมายถึง แอปพลิเคชัน Suck&Reed{"\n"}
            </Text>
            <Text style={textTitle}>การเก็บรวบรวมข้อมูล</Text>
            <Text style={{fontFamily: "Kanit"}}>
                  ในการให้บริการแอปพลิเคชันแก่เจ้าของข้อมูลส่วนบุคคล
              บริษัทจะทำการเก็บรวบรวมข้อมูลส่วนบุคคลโดยมีวัตถุประสงค์ ขอบเขต
              และใช้วิธีการที่ชอบด้วยกฎหมายและเป็นธรรม
              โดยในการเก็บรวบรวมนั้นจะทำเพียงเท่าที่จำเป็นแก่การให้บริการแก่ท่าน
              และเพื่อวัตถุประสงค์ที่ได้ระบุไว้ในนโยบายฯ นี้เท่านั้น
              โดยทั่วไปแล้ว บริษัทจะประมวลผลข้อมูลส่วนบุคคลของท่าน ดังต่อไปนี้
              2.1 ผู้ใช้งาน {"\n"}
              ข้อมูลที่ใช้ในการระบุตัวบุคคล ชื่อ อีเมล หมายเลขโทรศัพท์ รูปภาพ
              {"\n"}
            </Text>
            <Text style={textTitle}>แหล่งที่มาของข้อมูลส่วนบุคคล</Text>
            <Text style={{fontFamily: "Kanit"}}>
              3.1 ผู้ใช้งาน{"\n"}
                      3.1.1 บริษัทได้รับข้อมูลส่วนบุคคลจากท่านโดยตรง ดังนี้
              {"\n"}
                          (1)
              เมื่อท่านได้ทำการลงทะเบียนสมัครสมาชิกกับบริษัทหรือสมัครใช้บริการใด
              ๆ ของบริษัทบนแอปพลิเคชัน{"\n"}
                          (2) เมื่อท่านได้เข้าถึง และ/หรือใช้งานแอปพลิเคชัน
              รวมถึงการออกกำลังกาย การเข้าร่วมกิจกรรม และการแข่งขันต่าง ๆ
              บนแอปพลิเคชัน{"\n"}
                          (3) เมื่อท่านได้ทำธุรกรรมต่าง ๆ บนแอปพลิเคชัน
              รวมถึงการแลกของรางวัล{"\n"}
                          (4)
              เมื่อท่านได้เชื่อมโยงบัญชีผู้ใช้งานแอปพลิเคชันกับบัญชีสื่อสังคมออนไลน์
              หรือบัญชีผู้ใช้งานแอปพลิเคชันอื่นใดของท่าน
              บริษัทจะทำการประมวลผลข้อมูลสื่อสังคมออนไลน์
              หรือข้อมูลเกี่ยวกับแอปพลิเคชันอื่นใดของท่านดังกล่าว{"\n"}
              (5) จากความสมัครใจของท่าน เมื่อท่านได้ทำการร้องเรียน ติชม สอบถาม
              ทำแบบสอบถาม หรือติดต่อสื่อสารกับบริษัทบนแอปพลิเคชัน ผ่านทางอีเมล
              โทรศัพท์ หรือช่องทางการสื่อสารอื่นใด {"\n"}
              3.2 ตัวแทนลูกค้านิติบุคคล {"\n"}
                      3.2.1 บริษัทได้รับข้อมูลส่วนบุคคลจากท่านโดยตรงดังนี้{" "}
              {"\n"}
                          (1)
              เมื่อท่านได้ทำการลงทะเบียนสมัครสมาชิกกับบริษัทหรือสมัครใช้บริการใด
              ๆ ของบริษัทบนแอปพลิเคชัน{"\n"}             (2)
              เมื่อท่านได้เข้าถึงและ/หรือใช้งานแอปพลิเคชัน{"\n"}             (3)
              เมื่อท่านได้ทำธุรกรรมต่างๆ บนแอปพลิเคชัน {"\n"}
            </Text>
            <Text style={textTitle}>การทบทวนและเปลี่ยนแปลงนโยบาย</Text>
            <Text style={{fontFamily: "Kanit"}}>
                แอปพลิเคชันอาจทำการทบทวนและปรับปรุงแก้ไขนโยบายฯฉบับนี้เป็นครั้งคราวเพื่อให้สอดคล้องกับกฎหมายที่ใช้บังคับการเปลี่ยนแปลงการดำเนินงานของบริษัทใดๆ
              ซึ่งมีนัยสำคัญ รวมถึงข้อเสนอแนะและความคิดเห็นจากหน่วยงานอื่น ๆ
               ในกรณีที่การเปลี่ยนแปลงนั้นเกี่ยวข้องกับการเปลี่ยนแปลงวัตถุประสงค์ของการประมวลผลเราจะแจ้งให้เจ้าของข้อมูลส่วนบุคคลทราบถึงวัตถุประสงค์ใหม่ดังกล่าว
              และในกรณีที่กฎหมายกำหนด
              เราจะดำเนินการที่จำเป็นเพื่อให้ได้รับความยินยอมของท่านก่อนที่การเปลี่ยนแปลงดังกล่าวจะมีผลใช้บัง{"\n"}{"\n"}{"\n"}{"\n"}{"\n"}{"\n"}{"\n"}{"\n"}{"\n"}
            </Text>
          </View>
        </ScrollView>
      </View>
    </View>
  );
};

export default PolicyScreen;
